In [10]:
import pandas as pd

Merging and joining the data
1. Inner Join --> merge( on"common_col_in_tables") 
2. Left Join --> merge(how="left")
3. Right Join --> merge(how="right")
4. Outer Join --> merge(how="outer")

In [ ]:
# 1. Customer information table
customers_df = pd.DataFrame(
    {
        "customer_id": [101, 102, 103, 104],
        "name": ["Alice", "Bob", "sadit", "Rana"],
        "city": ["Dhaka", "Chittagong", "Chittagong", "Sylhet"],
    }
)

# 2. Order details table
orders_df = pd.DataFrame(
    {
        "customer_id": [101, 104, 105, 103],
        "order_id": [5001, 5002, 5003, 5000],
        "product": ["Laptop", "Mouse", "Dildo", "Keyboard"],
        "price": [85000, 1500, 3000, 9000],
    }
)

customers_df

   customer_id   name        city
0          101  Alice       Dhaka
1          102    Bob  Chittagong
2          103  sadit  Chittagong
3          104   Rana      Sylhet

In [12]:
orders_df

   customer_id  order_id   product  price
0          101      5001    Laptop  85000
1          104      5002     Mouse   1500
2          105      5003     Dildo   3000
3          103      5000  Keyboard   9000

In [13]:
inner_merge = pd.merge(customers_df, orders_df, on="customer_id")
inner_merge

   customer_id   name        city  order_id   product  price
0          101  Alice       Dhaka      5001    Laptop  85000
1          103  sadit  Chittagong      5000  Keyboard   9000
2          104   Rana      Sylhet      5002     Mouse   1500

In [14]:
right_merge = pd.merge(customers_df, orders_df, how="right")
right_merge

   customer_id   name        city  order_id   product  price
0          101  Alice       Dhaka      5001    Laptop  85000
1          104   Rana      Sylhet      5002     Mouse   1500
2          105    NaN         NaN      5003     Dildo   3000
3          103  sadit  Chittagong      5000  Keyboard   9000

In [15]:
left_merge = pd.merge(customers_df, orders_df, how="left")
left_merge

   customer_id   name        city  order_id   product    price
0          101  Alice       Dhaka    5001.0    Laptop  85000.0
1          102    Bob  Chittagong       NaN       NaN      NaN
2          103  sadit  Chittagong    5000.0  Keyboard   9000.0
3          104   Rana      Sylhet    5002.0     Mouse   1500.0

In [16]:
outer_merge = pd.merge(customers_df, orders_df, how="outer")
outer_merge

   customer_id   name        city  order_id   product    price
0          101  Alice       Dhaka    5001.0    Laptop  85000.0
1          102    Bob  Chittagong       NaN       NaN      NaN
2          103  sadit  Chittagong    5000.0  Keyboard   9000.0
3          104   Rana      Sylhet    5002.0     Mouse   1500.0
4          105    NaN         NaN    5003.0     Dildo   3000.0